Revit 2026 API

# RebarBendingDetailSetTagRelativePosition Method

---

Sets the embedded tag position w.r.t. the realistic bending detail element in model coordinates.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void SetTagRelativePosition(
	Element bendingDetail,
	XYZ relativeOffset
)
```
```vb
Public Shared Sub SetTagRelativePosition (
	bendingDetail As Element,
	relativeOffset As XYZ
)
```
```cpp
public:
static void SetTagRelativePosition(
	Element^ bendingDetail,
	XYZ^ relativeOffset
)
```
```fsharp
static member SetTagRelativePosition :
        bendingDetail : Element *
        relativeOffset : XYZ -> unit
```

#### Parameters

bendingDetail Element
     The bending detail element.
relativeOffset XYZ
     The new relative position of the embedded tag w.r.t. the bending detail element.

| Exception | Condition |
| --- | --- |
| ArgumentException | This option is only available for realistic bending detail elements. -or- The input point lies outside of Revit design limits. |
| ArgumentNullException | A non-optional argument was null |

This function is exclusive to realistic bending detail mode.

#### Reference

RebarBendingDetail Class

Autodesk.Revit.DB.Structure Namespace